# 1 がゴール
maze = [
    [9, 9, 9, 9, 9, 9, 9, 9, 9],
    [9, 0, 0, 0, 9, 9, 0, 9, 9],
    [9, 0, 9, 9, 0, 0, 0, 0, 9],
    [9, 0, 0, 0, 0, 9, 9, 9, 9],
    [9, 9, 0, 9, 0, 9, 0, 1, 9],
    [9, 0, 0, 9, 0, 0, 0, 9, 9],
    [9, 0, 9, 0, 0, 9, 0, 0, 9],
    [9, 9, 9, 9, 9, 9, 9, 9, 9],
]

# 移動する方向
d = [[0, -1], [-1, 0], [0, 1], [1, 0]]
# 初期値
x, y = 1, 1

# 進行方向をセット
dir = 0

while maze[x][y] != 1:
    move = d[(dir + 1) % 4]  # 進行方向の右側
    if maze[(x + move[0])][y + move[1]] != 9:
        # 壁でなければ移動し、進行方向を右に変える
        dir = (dir + 1) % 4
        x += move[0]
        y += move[1]
        print(x, y)
    else:
        # 壁の場合は進行方向を左に変える
        dir = (dir + 3) % 4
